#!/usr/bin/python
# -*- coding:UTF-8 -*-

# 题目：一个整数，它加上100后是一个完全平方数，再再加上168又是一个完全平方数，# 请问该数是多少？

# 程序分析：假设该数为X
# 1、则：x + 100 = n^2, x + 100 + 168 = m^2
# 2、计算等式：m^2 - n^2 = (m + n)(m - n) = 168
# 3、设置：m + n = i, m - n = j, i * j = 168,i和j至少一个偶数
# 4、可得：m = (i + j)/2, n =(i - j)/2,i和j要么都是偶数，要么都是奇数。
# 5、从3和4推导可知道，i与j均是大于等于2的偶数。
# 6、由于i * j = 168,j>=2,则1<i<168/2+1.
# 7、接下来将i的所有数字循环计算即可。


for i in range(1,85):
	if 168 % i == 0:
		j = 168 / i;
		if i>j and (i+j) % 2 == 0 and (i-j) % 2 == 0:
			m = (i+j)/2
			n = (i-j)/2
			x = n*n - 100
			print(x)



